/*Карты в колоде располагаются по четыре, одинакового номинала разных мастей.
Джокер имеет номинал 13, масть 4, нормальные карты - номинал 0 - 12, масть 0 -3.*/
#ifndef __CARD
#define __CARD

class Card{
	int count;
	bool in_deck;
public:	
//**************************************************************************************************
//Конструктор, геттеры, сеттеры:
//**************************************************************************************************
	Card( int _count );
	int get_count();
	void set_in_deck( bool _in_deck );
	bool get_in_deck();
	int get_nominal();
	int get_suit();
};
#endif