#ifndef __CPU_PLAYER
#define __CPU_PLAYER
#include "Player.h"
#include <iostream>
using namespace std;
//Минимальная ставка с игрока
#define START_STAKES 100
//Минимальный шаг для повышения ставки
#define STAKES_STEP 50
class Cpu_player:public Player{
public:
//**************************************************************************************************
//Компьютерный игрок решает, хочет ли он инициировать поднятие ставок:
//**************************************************************************************************
	int init_up_stakes(const int i,bool& in_game,const int combo,const int count_players,int& stakes);
//**************************************************************************************************
//Компьютерный игрок решает, согласен ли он на поднятие ставок:
//**************************************************************************************************
	void agree_up_stakes(const int i,bool& in_game,const int combo,const int count_players,int& stakes,int& last_in_game);
//**************************************************************************************************
//Перегружаем виртуальную функцию проверки на флеш, это лучше сделать, т.к.
//для человеческого игрока важно лишь распознать собранный флеш,
//а компьютеру нужно просчитать еще и какие карты скорее в него войдут.
//**************************************************************************************************
	bool is_flush();
//**************************************************************************************************
//Отмечаем для замены все, что не входит в собираемую комбинацию:
//**************************************************************************************************
	void choose_cards_to_change();
//**************************************************************************************************
//Выбираем собираемую комбинацию:
//**************************************************************************************************
	void make_a_choise();
};
//**************************************************************************************************
#endif