#ifndef __GAME
#define __GAME
#include "Player.h"
#include "Cpu_player.h"
#include "Round.h"
class Game{
	Player** _players;
	int count_players;
	Deck my_deck;
	Round* round;
	public:
//**************************************************************************************************
//Создаем игру на _count_players игроков:
//**************************************************************************************************
	Game(int _count_players);
//**************************************************************************************************
//Запускаем раунд за раундом пока у всех есть деньги:
//**************************************************************************************************
	void Run();
};
#endif